def caching_fibonacci():
    """
    Створює та повертає функцію для обчислення чисел Фібоначчі
    з використанням кешування через замикання.
    """
    #Словник для зберігання вже обчислених значень
    cache = {}

    def fibonacci(n):
        """
        Обчислює n-е число Фібоначчі рекурсивно.
        """
        # Базові випадки: якщо n <= 0, повертаємо 0; якщо n == 1, повертаємо 1
        if n <= 0:
            return 0
        if n == 1:
            return 1
        
        # Перевірка, чи є вже обчислене значення в кеші
        if n in cache:
            return cache[n]
        
        # Якщо значення в кеші немає, обчислюємо його рекурсивно і додаємо в словник
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        
        return cache[n]

    return fibonacci


if __name__ == "__main__":
    fib = caching_fibonacci()

    print(fib(10))  # Має вивести 55
    print(fib(15))  # Має вивести 610
    
 